# St7GetNumEnvelopes

Returns the number of envelopes for the currently open solution.

long St7GetNumEnvelopes(long uID, long* NumLimitEnvelopes,
long* NumCombinationEnvelopes, long* NumFactorsEnvelopes)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
NumLimitEnvelopes
Number of limit envelopes.
NumCombinationEnvelopes
Number of combination envelopes.
NumFactorsEnvelopes
Number of factors envelopes.